In [80]:
import pandas as pd

In [81]:
hs = pd.read_parquet('corrected_cleaned_HS.parquet')
hs.head(2)

,index,Name,School,Power,50 Y Free Time,50 S Free Time,50 L Free Time,100 Y Free Time,100 S Free Time,100 L Free Time,...,200 S Fly Points,200 L Fly Points,100 Y IM Points,100 S IM Points,200 Y IM Points,200 S IM Points,200 L IM Points,400 Y IM Points,400 S IM Points,400 L IM Points
ID,,,,,,,,,,,,,,,,,,,,,
515075,0,Tiago ASAKAWA,UMBC,15.96,<NA>,<NA>,23.31,<NA>,50.21,<NA>,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
413265,1,Niklas Weigelt,UMBC,8.38,<NA>,<NA>,23.60,44.36,<NA>,<NA>,...,NaN,NaN,100.0,NaN,18.97,NaN,NaN,100.0,NaN,NaN

In [82]:
col = pd.read_parquet('4YR_cleaned_USAS.parquet')
col.head(2)

,Event,Conf_Rank,Time,Name,School,Standard,Date,Gender,Division,Season,SeasonYear,Time_Adj,Time_Sec,Points,Div_Rank,NCAA_Rank,Power
0,50 Freestyle SCY Male,2,20.20,Tiago ASAKAWA,UMBC,NS,2020-02-14,M,I,19_20,2020,0 days 00:00:20.200000,20.20,664.818090,252.0,291.0,15.96
1,50 Freestyle SCY Male,4,20.72,Niklas Weigelt,UMBC,NS,2020-02-14,M,I,19_20,2020,0 days 00:00:20.720000,20.72,616.009888,542.0,690.0,8.38

In [83]:
hs.shape

(11587, 92)

In [84]:
col.shape

(299511, 17)

In [85]:
hs.Name.nunique()

11243

In [86]:
col.Name.nunique()

14556

In [87]:
hs[hs.Name=='Aidan Wilson']

,index,Name,School,Power,50 Y Free Time,50 S Free Time,50 L Free Time,100 Y Free Time,100 S Free Time,100 L Free Time,...,200 S Fly Points,200 L Fly Points,100 Y IM Points,100 S IM Points,200 Y IM Points,200 S IM Points,200 L IM Points,400 Y IM Points,400 S IM Points,400 L IM Points
ID,,,,,,,,,,,,,,,,,,,,,
608415,1358,Aidan Wilson,Brown University,7.12,22.91,<NA>,<NA>,48.04,<NA>,<NA>,...,NaN,NaN,62.68,NaN,21.95,NaN,NaN,9.52,NaN,NaN
1317892,12980,Aidan Wilson,Kings College (Pennsylvania),83.03,24.06,<NA>,<NA>,53.61,<NA>,<NA>,...,NaN,NaN,NaN,NaN,100.00,NaN,NaN,NaN,NaN,NaN

In [88]:
hs.at[1052055,'Name']='Aidan Wilson'

In [89]:
unique_names_hs = hs['Name'].unique().tolist()
unique_names_col = col['Name'].unique().tolist()

In [90]:
unique_names_hs_lower = [name.lower() for name in unique_names_hs]
unique_names_col_lower = [name.lower() for name in unique_names_col]

count = 0
for name in unique_names_hs_lower:
    found = False
    for name2 in unique_names_col_lower:
        if (name == name2):
            found = True
    if (found == False):
        count = count + 1
        print(name)
print(count)

0

In [91]:
hs = hs.reset_index().drop('index',axis=1)
hs.head(2)

,ID,Name,School,Power,50 Y Free Time,50 S Free Time,50 L Free Time,100 Y Free Time,100 S Free Time,100 L Free Time,...,200 S Fly Points,200 L Fly Points,100 Y IM Points,100 S IM Points,200 Y IM Points,200 S IM Points,200 L IM Points,400 Y IM Points,400 S IM Points,400 L IM Points
0,515075,Tiago ASAKAWA,UMBC,15.96,<NA>,<NA>,23.31,<NA>,50.21,<NA>,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,413265,Niklas Weigelt,UMBC,8.38,<NA>,<NA>,23.60,44.36,<NA>,<NA>,...,NaN,NaN,100.0,NaN,18.97,NaN,NaN,100.0,NaN,NaN

In [92]:
col_filtered = col[col['Name'].str.lower().isin(unique_names_hs_lower)]

In [93]:
col_filtered.shape

(231748, 17)

In [94]:
name_mapping = {
    'Fla Atlantic (M)': 'Florida Atlantic University',
    'Fla Atlantic (W)': 'Florida Atlantic University',
    'Loyola (MD)': 'Loyola University (Maryland)',
    'U.S. Navy': 'U.S. Naval Academy (Navy)',
    'UW-Stevens Point': 'University of Wisconsin-Stevens Point',
    'UWEC': 'University of Wisconsin-Eau Claire',
    'Wash U. MO': 'Washington University (Missouri)',
    'Georgia Tech': 'Georgia Institute of Technology',
    'Virginia MI': 'Virginia Military Institute',
    'Iona Coll': 'Iona University',
    'Wheaton IL': 'Wheaton College (Illinois)',
    'TCNJ': 'College of New Jersey, The',
    'UMSL': 'University of Missouri-St. Louis',
    'Henderson St.': 'Henderson State University',
    'IWU': 'Indiana Wesleyan University',
    'SMU': 'Southern Methodist University',
    'UCSB': 'University of California-Santa Barbara',
    'Missouri St (W)': 'Missouri State University',
    'NC State': 'North Carolina State University',
    'USMMA': 'U.S. Merchant Marine Academy',
    'NDC': 'Notre Dame (Ohio) College',
    'Air Force (W)': 'U.S. Air Force Academy',
    'St. Norbert': 'St Norbert College',
    'W&L': 'Washington and Lee University',
    'UNC Wilmington': 'University of North Carolina, Wilmington',
    'SHIP': 'Shippensburg University',
    'IU Indianapolis': 'Indiana University-Indianapolis',
    'Cal Poly': 'California Polytechnic State University',
    'BSC': 'Birmingham Southern College',
    'Wyoming (M)': 'University of Wyoming',
    'MIT': 'Massachusetts Institute of Technology',
    'Bryant U (W)': 'Bryant University',
    'St. Louis': 'Saint Louis University',
    'UN Omaha': 'University of Nebraska, Omaha',
    'TAMPA': 'University of Tampa',
    'Claremont MS': 'Claremont McKenna-Harvey Mudd-Scripps Colleges',
    'Wheaton MA': 'Wheaton College (Massachusetts)',
    'Evansville (M)': 'University of Evansville',
    'Fla Atlantic (M)': 'Florida Atlantic University',
    'UNE': 'University of New England',
    'Trinity C.': 'Trinity College (Connecticut)',
    'SUNY Geneseo': 'State University of New York at Geneseo',
    'Catholic UA': 'Catholic University',
    'Colorado St.': 'Colorado State University',
    'Frostburg St.': 'Frostburg State University',
    'UNC': 'University of North Carolina, Chapel Hill',
    'F&M': 'Franklin & Marshall College',
    'SUNY Brockport': 'State University of New York at Brockport',
    'Indy': 'University of Indianapolis',
    'Wyoming (W)': 'University of Wyoming',
    'NYU': 'New York University',
    'RIT': 'Rochester Institute of Technology',
    "St. John's": 'Saint Johns University',
    'St. Cloud St.-M': 'Saint Cloud State University',
    'TCU': 'Texas Christian University',
    'Truman St.': 'Truman State University',
    'Caltech': 'California Institute of Technology',
    'Evansville (W)': 'University of Evansville',
    'FDU-Florham': 'Fairleigh Dickinson University, Madison',
    'Illinois-Chicago': 'University of Illinois at Chicago',
    'Xavier': 'Xavier University',
    'MSU Mankato': 'Minnesota State University-Mankato',
    'Linfield': 'Linfield University',
    'LSU': 'Louisiana State University',
    'UW-L': 'University of Wisconsin-LaCrosse',
    'Keene St.': 'Keene State College',
    'Penn St': 'Pennsylvania State University',
    'SIUC (W)': 'Southern Illinois University',
    'Virginia Tech': 'Virginia Tech',
    'VASSAR': 'Vassar College',
    'R-MC': 'Randolph-Macon College',
    'Concordia Irvine': 'Concordia University Irvine',
    'Trinity U.': 'Trinity University (Texas)',
    'Miami (Ohio)': 'Miami University (Ohio)',
    'Michigan': 'University of Michigan',
    'E. Connecticut': 'Eastern Connecticut State University',
    "Mt St Mary's": "Mount Saint Mary's University (MD)",
    'GW': 'George Washington University',
    'Neb Wesleyan': 'Nebraska Wesleyan University',
    'Northwestern': 'Northwestern University',
    "Nova S'eastern": 'Nova Southeastern University',
    'SUNY Oneonta': 'Oneonta State University',
    'LIU': 'Long Island University',
    'IUP': 'Indiana University of Pennsylvania',
    'L&C': 'Lewis and Clark College',
    'Adams St.': 'Adams State University',
    'CALU-PA': 'Pennsylvania Western-California',
    'Bridgewater St.': 'Bridgewater State University',
    'Wis.- Green Bay': 'University of Wisconsin-Green Bay',
    'CMU': 'Carnegie Mellon University',
    'Virginia': 'University of Virginia',
    'YCP': 'York College (Pennsylvania)',
    'UTPB': 'University of Texas Permian Basin',
    'UNC Asheville': 'University of North Carolina Asheville',
    'UNLV (W)': 'University of Nevada, Las Vegas (UNLV)',
    'Washington St.': 'Washington State University',
    'Connecticut': 'Connecticut College',
    'Arcadia': 'Arcadia University',
    'UW-Oshkosh': 'University of Wisconsin-Oshkosh',
    'Bryant U (M)': 'Bryant University',
    'W&J': 'Washington & Jefferson College',
    'Northern Ariz': 'Northern Arizona University',
    'WCU': 'Western Colorado University',
    'WestConn': 'Western Connecticut State University',
    'Notre Dame': 'University of Notre Dame',
    'UNC- Pembroke': 'University of North Carolina-Pembroke',
    'UMary': 'University of Mary',
    'Augustana (M)': 'Augustana University',
    'Army': 'U.S. Military Academy (Army)',
    'Duke': 'Duke University',
    "King's": 'Kings College (Pennsylvania)',
    'Washington': 'Washington College (Maryland)',
    'Sou. Virginia': 'Southern Virginia University',
    'Pacific Lutheran': 'Pacific Lutheran University',
    'Augustana (W)': 'Augustana University',
    "St. Michael's": 'Saint Michaels College',
    'Missouri': 'University of Missouri',
    'Grinnell': 'Grinnell College',
    'Cal Lutheran': 'California Lutheran University',
    'California': 'University of California-Berkeley',
    'GA Southern': 'Georgia Southern University',
    'Hawaii': 'University of Hawaii',
    'Missouri S & T': 'Missouri University of Science & Technology',
    'SUNY New Paltz': 'State University of New York at New Paltz',
    'Alabama': 'University of Alabama',
    'Villanova': 'Villanova University',
    'Monmouth': 'Monmouth University',
    'UC Santa Cruz': 'University of California-Santa Cruz',
    'Montevallo': 'University of Montevallo',
    'CSU East Bay': 'California State University East Bay',
    'SUNY Potsdam': 'State University of New York at Potsdam',
    'Carthage': 'Carthage College',
    'Cal Baptist': 'California Baptist University',
    'Grand Canyon': 'Grand Canyon University',
    'Goucher': 'Goucher College',
    'Pomona-Pitzer': 'Pomona-Pitzer Colleges',
    'Piedmont': 'Piedmont University',
    'Grove City': 'Grove City College',
    'Purdue': 'Purdue University',
    'Illinois Chicago (W)': 'University of Illinois at Chicago',
    'WPUNJ': 'William Paterson University of New Jersey',
    'Hendrix': 'Hendrix College',
    'Rose-Hulman': 'Rose-Hulman Institute of Technology',
    'Virginia Wesleya': 'Virginia Wesleyan University',
    'Hartwick': 'Hartwick College',
    'Auburn': 'Auburn University',
    'Carroll': 'Carroll University (WI)',
    'Penn St. Altoona': 'Pennsylvania State University - Altoona',
    'Assumption': 'Assumption University',
    'McDaniel': 'McDaniel College',
    'Massachusetts': 'University of Massachusetts (Amherst)',
    'Air Force (M)': 'U.S. Air Force Academy',
    'Middlebury': 'Middlebury College',
    'Mines': 'Colorado School of Mines',
    'Minnesota': 'University of Minnesota',
    'Missouri St. (M)': 'Missouri State University',
    'Macalester': 'Macalester College',
    'Wingate': 'Wingate University',
    'Wilmington C.': 'Wilmington College (Ohio',
    'Lynchburg': 'University of Lynchburg',
    'Loy. Marymount': 'Loyola Marymount University',
    'Little Rock': 'University of Arkansas-Little Rock',
    'Nebraska Kearney': 'University of Nebraska at Kearney',
    'Nevada': 'University of Nevada',
    'Lees-McRae': 'Lees-McRae College',
    'Northern Colo': 'University of Northern Colorado',
    'Arizona': 'University of Arizona',
    'Lafayette': 'Lafayette College',
    'Westfield State': 'Westfield State University',
    'Georgia': 'University of Georgia',
    'West Virginia': 'West Virginia University',
    'Ohio St': 'Ohio State University',
    'Old Dominion (W)': 'Old Dominion University',
    'Olivet': 'Olivet Nazarene University',
    'Pacific Oregon': 'Pacific University',
    'John Carroll': 'John Carroll University',
    'Gordon': 'Gordon College (MA)',
    'Behrend': 'Penn State Behrend University',
    'Springfield': 'Springfield College',
    'Davis & Elkins': 'Davis and Elkins College',
    'Texas': 'University of Texas',
    'UNLV (M)': 'University of Nevada, Las Vegas (UNLV)',
    'Clarion': 'Clarion University',
    'CSUB': 'California State University, Bakersfield',
    'St. Francis': 'St Francis College Brooklyn (New York)',
    'Clarkson': 'Clarkson University',
    'Cleveland St': 'Cleveland State University',
    "Saint Peter's": 'Saint Peters University',
    'Texas A&M': 'Texas A&M University',
    'Brown': 'Brown University',
    'Salisbury': 'Salisbury University',
    'St. Thomas': 'University of Saint Thomas (MN)',
    'Emory': 'Emory University',
    'FGCU': 'Florida Gulf Coast University',
    'Seattle U (M)': 'Seattle University',
    'St. Olaf': 'St Olaf College',
    'Chicago': 'University of Chicago',
    'Denver': 'University of Denver',
    'St. Bonaventure': 'St Bonaventure University',
    'Utah': 'University of Utah',
    'Southern Cali': 'University of Southern California',
    'Berry': 'Berry College',
    'SUNY Maritime': 'State Maritime University of New York',
    'Gardner-Webb': 'Gardner-Webb University',
    'South Dakota St': 'South Dakota State University',
    'Campbell': 'Campbell University',
    'Valparaiso (W)': 'Valparaiso University',
    'Florida Tech': 'Florida Tech',
    'Centenary (LA)': 'Centenary College',
    'Transylvania': 'Transylvania University',
    'SUNY Oswego': 'State University of New York at Oswego',
    'Fresno Pacific': 'Fresno Pacific University',
    'Franklin': 'Franklin College',
    'South Dakota': 'University of South Dakota',
    "St. Mary's MD": "Saint Mary's College of Maryland",
    'St. Francis Pa.': 'Saint Francis University (Pennsylvania)',
    'Oberlin': 'Oberlin College',
    'Northern State': 'Northern State University',
    'North Texas': 'University of North Texas',
    'New Mexico': 'University of New Mexico',
    'New Hampshire': 'University of New Hampshire',
    "St. Joseph's LI": "Saint Joseph's University (Long Island)",
    "St. Cloud St.-W": 'Saint Cloud State University',
    'Oakland': 'Oakland University',
    'SUNY Fredonia': 'Fredonia State University',
    "St. Kate's": 'St Catherine University',
    'Montclair St.': 'Montclair State University',
    'Tulane': 'Tulane University',
    'Tufts': 'Tufts University',
    'Michigan St': 'Michigan State University',
    'Millikin': 'Millikin University',
    'Mills': 'Mills College',
    'Towson': 'Towson University',
    'Tennessee': 'University of Tennessee',
    'UMBC': 'UMBC',
    'Worcester Poly': 'Worcester Polytechnic Institute',
    'Westminster': 'Westminster College',
    'Sweet Briar': 'Sweet Briar College',
    'Stevens': 'Stevens Institute',
    'Southwestern': 'Southwestern University',
    'Widener': 'Widener University',
    'NJIT': 'New Jersey Institute of Technology',
    'Whitman': 'Whitman College',
    'NMU': 'Northern Michigan University',
    'Wheeling': 'Wheeling University',
    'Staten Island': 'College of Staten Island',
    'Ouachita': 'Ouachita Baptist University',
    'Southwest Minn.': 'Southwest Minnesota State University',
    'Rollins': 'Rollins College',
    'Ramapo': 'Ramapo College of New Jersey',
    'Redlands': 'University of Redlands',
    'Regis': 'Regis College (Massachusetts)',
    'Rensselaer': 'Rensselaer Polytechnic Institute',
    'Rhode Island': 'University of Rhode Island',
    'Rhodes': 'Rhodes College',
    'Rice': 'Rice University',
    'Richmond': 'University of Richmond',
    'Rider': 'Rider University',
    'Ripon': 'Ripon College',
    'Saint Leo': 'Saint Leo University',
    'Occidental': 'Occidental College',
    'Saint Joseph CT': 'University of Saint Joseph',
    'Saginaw Valley': 'Saginaw Valley State University',
    'Rowan': 'Rowan University',
    'Sacred Heart': 'Sacred Heart University',
    'SJCME': 'Saint Josephs College (Maine)',
    'Vermont': 'University of Vermont',
    'Valparaiso (M)': 'Valparaiso University',
    'SUNY Cobleskill': 'State University of New York at Cobleskill',
    'SUNY Cortland': 'State University of New York at Cortland',
    'SUNY Delhi': 'State University of New York at Delhi',
    'Saint Vincent': 'Saint Vincent College',
    'WVWC': 'West Virginia Wesleyan College',
    'Salem (M)': 'Salem University',
    'Salem College': 'Salem College',
    'Oklahoma Baptist': 'Oklahoma Baptist University',
    'Old Dominion (M)': 'Old Dominion University',
    'Wesleyan': 'Wesleyan University',
    'Skidmore': 'Skidmore College',
    'Vanderbilt': 'Vanderbilt University',
    'Ozarks': 'University of the Ozarks',
    'Sioux Falls': 'University of Sioux Falls',
    'Siena': 'Siena College',
    'Penn': 'University of Pennsylvania',
    'Sewanee': 'University of the South (Sewanee)',
    'Seton Hall': 'Seton Hall University',
    'Seattle U (W)': 'Seattle University',
    'Pepperdine': 'Pepperdine University',
    'Pitt-Bradford': 'University of Pittsburgh-Bradford',
    'Merrimack': 'Merrimack College',
    'Principia': 'Principia College',
    'Providence': 'Providence College',
    'Purchase College': 'Purchase College',
    'San Diego St': 'San Diego State University',
    'Queens (NC)': 'Queens University Charlotte',
    'Quincy': 'Quincy University',
    'Miami (FL)': 'University of Miami (Florida)',
    'Messiah': 'Messiah University',
    'Florida': 'University of Florida',
    'Coast Guard': 'U.S. Coast Guard Academy',
    'Biola University': 'Biola University',
    'Greensboro Coll.': 'Greensboro College',
    'Jewell': 'William Jewell College'
}

In [95]:
col_filtered['School'] = col_filtered['School'].replace(name_mapping)
hs['School'] = hs['School'].replace(name_mapping)

/tmp/ipykernel_1192361/2991944834.py:1: FutureWarning: The behavior of Series.replace (and DataFrame.replace) with CategoricalDtype is deprecated. In a future version, replace will only be used for cases that preserve the categories. To change the categories, use ser.cat.rename_categories instead.
  col_filtered['School'] = col_filtered['School'].replace(name_mapping)
/tmp/ipykernel_1192361/2991944834.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  col_filtered['School'] = col_filtered['School'].replace(name_mapping)

In [96]:
# Group hs by 'Name' and collect the unique 'School's associated with each 'Name'
hs_schools_grouped = hs.groupby('Name')['School'].apply(set).to_dict()

# Group col_filtered by 'Name' and collect the unique 'School's associated with each 'Name'
col_filtered_schools_grouped = col_filtered.groupby('Name')['School'].apply(set).to_dict()

# Create a list to store the results of the comparison
comparison_results = []

# For each 'Name' in col_filtered, check if all associated 'School's are also in hs
for name, schools in col_filtered_schools_grouped.items():
    # Get the schools associated with the current 'Name' in hs
    hs_schools = hs_schools_grouped.get(name, set())
    
    # Check if all schools in col_filtered for this 'Name' are also in hs
    is_subset = schools.issubset(hs_schools)
    
    # Append the result to the comparison_results list
    comparison_results.append((name, is_subset))

# Convert comparison_results to a DataFrame for easy inspection
comparison_df = pd.DataFrame(comparison_results, columns=['Name', 'All_Schools_Match'])

# Display the result
comparison_df[comparison_df['All_Schools_Match']==False]

/tmp/ipykernel_1192361/3908662787.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  hs_schools_grouped = hs.groupby('Name')['School'].apply(set).to_dict()
/tmp/ipykernel_1192361/3908662787.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  col_filtered_schools_grouped = col_filtered.groupby('Name')['School'].apply(set).to_dict()

                      Name  All_Schools_Match
93           Aaron Parrott              False
163             Abbey Webb              False
339            Abby Martin              False
349            Abby Miller              False
433    Abdelrahman Elaraby              False
...                    ...                ...
44152        Zander Minano              False
44155          Zandy Knoke              False
44221            Ziv Marco              False
44268            Zoe Mekus              False
44383          haley Thier              False

[1047 rows x 2 columns]

In [97]:
# Create a list to store the results of the comparison, including non-matching schools and all schools in hs
detailed_comparison_results = []

# For each 'Name' in col_filtered, check which 'School's don't match in hs
for name, schools in col_filtered_schools_grouped.items():
    # Get the schools associated with the current 'Name' in hs
    hs_schools = hs_schools_grouped.get(name, set())
    
    # Find the schools in col_filtered that are not in hs
    non_matching_schools = schools - hs_schools
    
    # If there are non-matching schools, add them to the results
    if non_matching_schools:
        detailed_comparison_results.append((name, non_matching_schools, hs_schools))

# Convert detailed_comparison_results to a DataFrame for easy inspection
non_matching_df = pd.DataFrame(detailed_comparison_results, columns=['Name', 'Non_Matching_Schools', 'All_Schools_in_hs'])

# Display the result
non_matching_df.head(20)

,Name,Non_Matching_Schools,All_Schools_in_hs
0,Aaron Parrott,{Louisiana State University},{Louisville}
1,Abbey Webb,{North Carolina State University},{Auburn University}
2,Abby Martin,"{Connecticut College, Bridgewater}",{University of Connecticut}
3,Abby Miller,{University of Southern California},"{University of Vermont, Hartwick College}"
4,Abdelrahman Elaraby,{University of Notre Dame},{Louisville}
5,Abigail Gibbons,{Bates},{Auburn University}
6,Abigail Greene,{Westminster College},{PennWest}
7,Abigail Nelson,{Incarnate Word},{Northern Arizona University}
8,Abram Hagedorn,{McKendree},{Notre Dame (Ohio) College}
9,Adam Jones,{Carson-Newman},{Birmingham Southern College}
10,Adam Mahler,"{University of North Carolina, Chapel Hill, Pi...",{East Carolina}
11,Addi Odonnell,{Western Colorado University},{West Chester University}
12,Addison Smith,"{University of North Carolina, Chapel Hill}",{Princeton}
13,Adela Vavrinova,{Arkansas},{East Carolina}
14,Adrian Aguilar,"{Macalester College, University of Tampa}",{Florida St}
15,Adrian Paseta,{Saint Louis University},"{California State University, Bakersfield}"
16,Adrianna Barone,{Gardner-Webb University},{Florida Int'l}
17,Aeson Akins,{Augustana University},{Augustana College}
18,Aidah Shuttleworth,{Hanover},{Bethany}
19,Aidan Campbell,{Randolph-Macon College},{Rainey McCullers School}

In [98]:
non_matching_df.shape

(1047, 3)

In [99]:
# Reset the index of hs to get 'ID' as a column instead of the index
hs_reset = hs.reset_index()

# Create a mapping of 'Name' to 'ID' from the reset 'hs' DataFrame
name_to_id_mapping = hs_reset.set_index('Name')['ID'].to_dict()

# Filter rows in 'col' based on the condition
col_filtered = col[col['Name'].str.lower().isin(unique_names_hs_lower)].copy()

# Add the 'ID' column to col_filtered using .loc to avoid the SettingWithCopyWarning
col_filtered.loc[:, 'ID'] = col_filtered['Name'].map(name_to_id_mapping)

col_filtered.ID = col_filtered.ID.astype('int')
col_filtered.ID = col_filtered.ID.astype('category')
col_filtered.head(2)

,Event,Conf_Rank,Time,Name,School,Standard,Date,Gender,Division,Season,SeasonYear,Time_Adj,Time_Sec,Points,Div_Rank,NCAA_Rank,Power,ID
0,50 Freestyle SCY Male,2,20.20,Tiago ASAKAWA,UMBC,NS,2020-02-14,M,I,19_20,2020,0 days 00:00:20.200000,20.20,664.818090,252.0,291.0,15.96,515075
1,50 Freestyle SCY Male,4,20.72,Niklas Weigelt,UMBC,NS,2020-02-14,M,I,19_20,2020,0 days 00:00:20.720000,20.72,616.009888,542.0,690.0,8.38,413265

In [100]:
col_filtered.shape

(231748, 18)

In [101]:
hs[hs.Name=='Nicholas Edwards']

,ID,Name,School,Power,50 Y Free Time,50 S Free Time,50 L Free Time,100 Y Free Time,100 S Free Time,100 L Free Time,...,200 S Fly Points,200 L Fly Points,100 Y IM Points,100 S IM Points,200 Y IM Points,200 S IM Points,200 L IM Points,400 Y IM Points,400 S IM Points,400 L IM Points
3171,490867,Nicholas Edwards,Western Connecticut State University,100.00,<NA>,<NA>,<NA>,55.88,<NA>,<NA>,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11437,663038,Nicholas Edwards,Rose-Hulman Institute of Technology,25.38,22.16,<NA>,<NA>,47.46,<NA>,<NA>,...,NaN,NaN,NaN,NaN,37.73,NaN,NaN,52.17,NaN,NaN

In [102]:
mini_df = col_filtered[['ID','Gender']].drop_duplicates()
mini_df.head()

       ID Gender
0  515075      M
1  413265      M
2  394588      M
3  471360      M
4  395308      M

In [103]:
mini_df_unique = mini_df.drop_duplicates(subset='ID')

# Now merge the dataframes
hs = hs.merge(mini_df_unique[['ID', 'Gender']], on='ID', how='left')
hs.head()

,ID,Name,School,Power,50 Y Free Time,50 S Free Time,50 L Free Time,100 Y Free Time,100 S Free Time,100 L Free Time,...,200 L Fly Points,100 Y IM Points,100 S IM Points,200 Y IM Points,200 S IM Points,200 L IM Points,400 Y IM Points,400 S IM Points,400 L IM Points,Gender
0,515075,Tiago ASAKAWA,UMBC,15.96,<NA>,<NA>,23.31,<NA>,50.21,<NA>,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,M
1,413265,Niklas Weigelt,UMBC,8.38,<NA>,<NA>,23.60,44.36,<NA>,<NA>,...,NaN,100.00,NaN,18.97,NaN,NaN,100.00,NaN,NaN,M
2,394588,Ben Beldner,Binghamton,22.71,21.22,<NA>,<NA>,47.00,<NA>,<NA>,...,NaN,NaN,NaN,70.80,NaN,NaN,NaN,NaN,NaN,M
3,471360,Justin Meyn,Binghamton,10.06,20.87,<NA>,<NA>,45.40,<NA>,<NA>,...,NaN,2.45,NaN,21.65,NaN,NaN,27.34,NaN,NaN,M
4,395308,Joshua Franco,New Jersey Institute of Technology,12.40,21.31,<NA>,<NA>,45.65,<NA>,<NA>,...,NaN,100.00,NaN,17.99,NaN,NaN,28.48,NaN,NaN,M

In [104]:
hs[hs.Name=='Brianna Brunk']

,ID,Name,School,Power,50 Y Free Time,50 S Free Time,50 L Free Time,100 Y Free Time,100 S Free Time,100 L Free Time,...,200 L Fly Points,100 Y IM Points,100 S IM Points,200 Y IM Points,200 S IM Points,200 L IM Points,400 Y IM Points,400 S IM Points,400 L IM Points,Gender
10429,1309404,Brianna Brunk,Millikin University,78.84,29.25,<NA>,<NA>,1:02.23,<NA>,<NA>,...,NaN,100.0,NaN,100.0,NaN,NaN,NaN,NaN,NaN,F

In [18]:
hs.to_parquet('corrected_HS_1_20.parquet',index=True)
col_filtered.to_parquet('corrected_Col_1_20.parquet',index=True)